module.exports = {
    printWidth: 100,            // следит, чтобы строчки кода были не длиннее 100 символов
    singleQuote: true,          // меняет двойные кавычки на одинарные
    trailingComma: 'all',       // расставляет висящие запятые после последнего свойства объектов
    bracketSpacing: true,       // ставит пробелы после открывающей и перед закрывающей скобками объектных литералов
    jsxBracketSameLine: false,  // помещает закрывающую угловую скобку > JSX-элемента на последнюю строчку
    tabWidth: 4,                // регулирует размер символа табуляции
    semi: true,                 // расставляет везде точки с запятой
};

// Список всех возможных опций Prettier.
// https://prettier.io/docs/en/options.html
